[
    {"Name":"แกงฮังเล",
    "Ingredients":{"เนื้อหมู":"เนื้อหมู 1000 กรัม", "พริกแกงฮังเล":"พริกแกงฮังเล 3-5 ช้อนโต๊ะ (ถ้าไม่มี พอใช้น้ำพริกแกงเผ็ด แทนได้)",
                    "ผงฮังเล":"ผงฮังเล 1-2 ช้อนโต๊ะ (ถ้าไม่มี พอใช้ผงกะหรี่แทนได้)", "ซิอิ๊วดำ":"ซิอิ๊วดำ 1 ช้อนโต๊ะ",
                    "น้ำตาลปี๊บ":"น้ำตาลปี๊บ 2 ช้อนโต๊ะ", "น้ำปลา":"น้ำปลา 2 ช้อนโต๊ะ", "น้ำมะขามเปียก":"น้ำมะขามเปียก 2-4 ช้อนโต๊ะ",
                    "ขิงซอย":"ขิงซอย 1/2 ถ้วย", "กระเทียมโทนดอง":"กระเทียมโทนดอง 2 ช้อนโต๊ะ", "ถั่วลิสงคั่ว":"ถั่วลิสงคั่ว 2 ช้อนโต๊ะ"},
    "Recipe":["หมักหมู โดยนำหมูที่หั่นเตรียมไว้ ผสมกับพริกแกงฮังเล และซิอิ๊วดำ คลุกเข้ากันให้ทั่ว หมักทิ้งไว้ 1 ชั่วโมง",
            "ตั้งน้ำมันในกระทะบนไฟร้อนปานกลาง ใส่เนื้อหมูที่หมักไว้ลงไปผัด พอให้ผิวด้านนอกสุก จากนั้นจึงใส่น้ำเปล่าลงไปพอท่วม คนให้ส่วนผสมเข้ากัน และเคี่ยวด้วยไฟอ่อนทิ้งไว้อย่างน้อย 1 ชั่วโมง หมั่นคนเรื่อยๆระหว่างเคี่ยว ถ้าน้ำแห้งสามารถเติมน้ำเพิ่มได้",
            "เมื่อเเคี่ยวจนครบหนึ่งชั่วโมง หรือเนื้อหมูนุ่มดีแล้ว ปรุงรสด้วยน้ำตาลมะพร้าว, น้ำมะขามเปียก และน้ำปลา จากนั้นจึงใส่ขิงซอย, กระเทียมโทน และถั่วลิสงคั่ว",
            "คนให้ส่วนผสมเข้ากัน และเคี่ยวต่อไปอีกสักพัก จึงปิดไฟ ตักใส่ถ้วยและเสิร์ฟ"]},
    
    {"Name":"ไข่เจียววุ้นเส้น",
    "Ingredients":{"ไข่ไก่":"ไข่ไก่ 4 ฟอง", "น้ำปลา":"น้ำปลา 1 ช้อนโต๊ะ", "วุ้นเส้น":"วุ้นเส้น 1 ห่อ", "กุ้งสับ":"กุ้งสับ 200 กรัม"},
    "Recipe":["นำวุ้นเส้นมาแช่น้ำให้เส้นนุ่ม แล้วพักไว้", "ตอกไข่ใส่ชาม ตามด้วยน้ำปลา แล้วตีให้เข้ากัน", "นำวุ้นเส้นที่แช่น้ำจนนิ่ม กับเนื้อกุ้งสับ ใส่ลงไปในชามผสม คนให้เข้ากัน", "ใช้หม้อเทฟลอนทรงลึกมาตั้งไฟกลาง ใส่น้ำมัน รอจนน้ำมันร้อน เทส่วนผสมในชามลงไป",
               "คอยแง้มดูไข่ด้านใต้เป็นระยะ อย่าทิ้งไว้นานเพราะจะไหม้ เมื่อได้สีน้ำตาลทอง ให้พลิกไข่กลับด้าน แล้วทอดจนสีเท่ากันทั้งหมด", "จัดใส่จานเสิร์ฟ โรยตกแต่งด้วยต้นหอมซอย พร้อมรับประทาน!"]},
    
    {"Name":"ข้าวผัดไข่",
    "Ingredients":{"ข้าวสวย":"ข้าวสวยหุงแช่ค้างคืน 2 ถ้วยตวง", "กระเทียมสับ":"กระเทียมสับ 1 ช้อนโต๊ะ", "ไข่ไก่":"ไข่ไก่ 2 ฟอง",
                    "น้ำมัน":"น้ำมัน 2 ช้อนโต๊ะ", "ซอสฝาเขียว":"ซอสฝาเขียว 1/2 ช้อนโต๊ะ", "น้ำตาล":"น้ำตาล 1/2 ช้อนชา", 
                    "ผงปรุงรสหมู":"ผงปรุงรสหมู 1/2 ช้อนชา", "ต้นหอมซอย":"ต้นหอมซอย 1 ช้อนโต๊ะ", "พริกไทยป่น":"พริกไทยป่นเล็กน้อย"},
    "Recipe":["เปิดเตาใช้ไฟแรง วางกระทะรอจนกว่ากระทะจะร้อน หลังจากนั้นเทน้ำมันลงไป แล้ววนน้ำมันให้เคลือบทั่วทั้งกระทะ", "น้ำมันร้อนแล้วใส่กระเทียม ผัดจนกระเทียมส่งกลิ่นหอม ตามด้วยใส่ข้าวหุงแช่เย็น แล้วผัดข้าวจนน้ำมันเคลือบเม็ดข้าวทั่วดี",
                "เอาตะหลิวโกยข้าวไว้เป็นฝั่งเดียวกัน จากนั้นให้ตอกไข่ลงไปบนฝั่งกระทะที่ว่าง ก่อนใช้ตะหลิวยีไข่แดงไข่ขาวให้เข้ากัน", "อย่าปล่อยให้ไข่สุกจนหมด ให้รีบโกยข้าวจากอีกฝั่งมาผัดรวมกับไข่ จนข้าวทั้งกระทะเคลือบสีเหลืองทอง",
                "เริ่มปรุงรส โดยใส่ซอสฝาเขียว น้ำตาล ผงปรุงรสหมู แล้วผัดให้เข้ากันอีกครั้งจนข้าวแห้งดี", "ใส่ต้นหอมซอย พริกไทย ผัดให้เข้ากันแล้วปิดไฟ เป้นอันพร้อมเสิร์ฟ"]}
]