[
    {"Name":"แกงฮังเล",
    "Ingredients":{"เนื้อหมู":"เนื้อหมู 1000 กรัม", "พริกแกงฮังเล":"พริกแกงฮังเล 3-5 ช้อนโต๊ะ (ถ้าไม่มี พอใช้น้ำพริกแกงเผ็ด แทนได้)",
                    "ผงฮังเล":"ผงฮังเล 1-2 ช้อนโต๊ะ (ถ้าไม่มี พอใช้ผงกะหรี่แทนได้)", "ซิอิ๊วดำ":"ซิอิ๊วดำ 1 ช้อนโต๊ะ",
                    "น้ำตาลปี๊บ":"น้ำตาลปี๊บ 2 ช้อนโต๊ะ", "น้ำปลา":"น้ำปลา 2 ช้อนโต๊ะ", "น้ำมะขามเปียก":"น้ำมะขามเปียก 2-4 ช้อนโต๊ะ",
                    "ขิงซอย":"ขิงซอย 1/2 ถ้วย", "กระเทียมโทนดอง":"กระเทียมโทนดอง 2 ช้อนโต๊ะ", "ถั่วลิสงคั่ว":"ถั่วลิสงคั่ว 2 ช้อนโต๊ะ"},
    "Recipe":["หมักหมู โดยนำหมูที่หั่นเตรียมไว้ ผสมกับพริกแกงฮังเล และซิอิ๊วดำ คลุกเข้ากันให้ทั่ว หมักทิ้งไว้ 1 ชั่วโมง",
            "ตั้งน้ำมันในกระทะบนไฟร้อนปานกลาง ใส่เนื้อหมูที่หมักไว้ลงไปผัด พอให้ผิวด้านนอกสุก จากนั้นจึงใส่น้ำเปล่าลงไปพอท่วม คนให้ส่วนผสมเข้ากัน และเคี่ยวด้วยไฟอ่อนทิ้งไว้อย่างน้อย 1 ชั่วโมง หมั่นคนเรื่อยๆระหว่างเคี่ยว ถ้าน้ำแห้งสามารถเติมน้ำเพิ่มได้",
            "เมื่อเเคี่ยวจนครบหนึ่งชั่วโมง หรือเนื้อหมูนุ่มดีแล้ว ปรุงรสด้วยน้ำตาลมะพร้าว, น้ำมะขามเปียก และน้ำปลา จากนั้นจึงใส่ขิงซอย, กระเทียมโทน และถั่วลิสงคั่ว",
            "คนให้ส่วนผสมเข้ากัน และเคี่ยวต่อไปอีกสักพัก จึงปิดไฟ ตักใส่ถ้วยและเสิร์ฟ"],"Image":"https://www.unileverfoodsolutions.co.th/dam/global-ufs/mcos/SEA/calcmenu/recipes/TH-recipes/soups/%E0%B9%81%E0%B8%81%E0%B8%87%E0%B8%AE%E0%B8%B1%E0%B8%87%E0%B9%80%E0%B8%A5/%E0%B9%81%E0%B8%81%E0%B8%87%E0%B8%AE%E0%B8%B1%E0%B8%87%E0%B9%80%E0%B8%A5_header.jpg",
            "ImageCredit":"https://www.unileverfoodsolutions.co.th/th/recipe/%E0%B9%81%E0%B8%81%E0%B8%87%E0%B8%AE%E0%B8%B1%E0%B8%87%E0%B9%80%E0%B8%A5-R0070503.html"},
    
    {"Name":"ไข่เจียววุ้นเส้น",
    "Ingredients":{"ไข่ไก่":"ไข่ไก่ 4 ฟอง", "น้ำปลา":"น้ำปลา 1 ช้อนโต๊ะ", "วุ้นเส้น":"วุ้นเส้น 1 ห่อ", "กุ้งสับ":"กุ้งสับ 200 กรัม"},
    "Recipe":["นำวุ้นเส้นมาแช่น้ำให้เส้นนุ่ม แล้วพักไว้", "ตอกไข่ใส่ชาม ตามด้วยน้ำปลา แล้วตีให้เข้ากัน", "นำวุ้นเส้นที่แช่น้ำจนนิ่ม กับเนื้อกุ้งสับ ใส่ลงไปในชามผสม คนให้เข้ากัน", "ใช้หม้อเทฟลอนทรงลึกมาตั้งไฟกลาง ใส่น้ำมัน รอจนน้ำมันร้อน เทส่วนผสมในชามลงไป",
               "คอยแง้มดูไข่ด้านใต้เป็นระยะ อย่าทิ้งไว้นานเพราะจะไหม้ เมื่อได้สีน้ำตาลทอง ให้พลิกไข่กลับด้าน แล้วทอดจนสีเท่ากันทั้งหมด", "จัดใส่จานเสิร์ฟ โรยตกแต่งด้วยต้นหอมซอย พร้อมรับประทาน!"]},
    
    {"Name":"ข้าวผัดไข่",
    "Ingredients":{"ข้าวสวย":"ข้าวสวยหุงแช่ค้างคืน 2 ถ้วยตวง", "กระเทียม":"กระเทียมสับ 1 ช้อนโต๊ะ", "ไข่ไก่":"ไข่ไก่ 2 ฟอง",
                    "น้ำมัน":"น้ำมัน 2 ช้อนโต๊ะ", "ซอสฝาเขียว":"ซอสฝาเขียว 1/2 ช้อนโต๊ะ", "น้ำตาล":"น้ำตาล 1/2 ช้อนชา", 
                    "ผงปรุงรสหมู":"ผงปรุงรสหมู 1/2 ช้อนชา", "ต้นหอมซอย":"ต้นหอมซอย 1 ช้อนโต๊ะ", "พริกไทยป่น":"พริกไทยป่น 1/2 ช้อนชา"},
    "Recipe":["เปิดเตาใช้ไฟแรง วางกระทะรอจนกว่ากระทะจะร้อน หลังจากนั้นเทน้ำมันลงไป แล้ววนน้ำมันให้เคลือบทั่วทั้งกระทะ", "น้ำมันร้อนแล้วใส่กระเทียม ผัดจนกระเทียมส่งกลิ่นหอม ตามด้วยใส่ข้าวหุงแช่เย็น แล้วผัดข้าวจนน้ำมันเคลือบเม็ดข้าวทั่วดี",
                "เอาตะหลิวโกยข้าวไว้เป็นฝั่งเดียวกัน จากนั้นให้ตอกไข่ลงไปบนฝั่งกระทะที่ว่าง ก่อนใช้ตะหลิวยีไข่แดงไข่ขาวให้เข้ากัน", "อย่าปล่อยให้ไข่สุกจนหมด ให้รีบโกยข้าวจากอีกฝั่งมาผัดรวมกับไข่ จนข้าวทั้งกระทะเคลือบสีเหลืองทอง",
                "เริ่มปรุงรส โดยใส่ซอสฝาเขียว น้ำตาล ผงปรุงรสหมู แล้วผัดให้เข้ากันอีกครั้งจนข้าวแห้งดี", "ใส่ต้นหอมซอย พริกไทย ผัดให้เข้ากันแล้วปิดไฟ เป้นอันพร้อมเสิร์ฟ"]},
    
    {"Name":"ปีกไก่ทอดน้ำปลา",
    "Ingredients":{"ปีกไก่":"ปีกไก่ 500 กรัม", "น้ำปลา":"น้ำปลา 1 ช้อนโต๊ะ", "น้ำตาล":"น้ำตาลทราย 1/2 ช้อนชา", "พริกไทยป่น":"พริกไทยป่น 1/2 ช้อนชา"},
    "Recipe":["นำปีกไก่มาล้างทำความสะอาด และผึ่งไว้ให้หมาด", "ก่อนหมักไก่ให้นำส้อมมาจิ้มปีกไก่ให้ทั่ว เพื่อให้น้ำหมักเข้าเนื้อ", 
            "ใส่น้ำปลา น้ำตาล พริกไทยป่น แล้วคลุกเข้าเข้ากัน", "ใช้แรปพลาสติกปิดไว้ แล้วนำไปเข้าตู้เย็น หมักไว้ 30 นาที - 1 ชั่วโมง",
            "ตั้งน้ำมันให้ร้อนได้ที่ ใช้ไฟกลาง ใส่ปีกไก่ที่หมักแล้วลงไปทอด ให้น้ำมันท่วมไก่", "เมื่อไก่สุกได้ที่ ให้เร่งไฟเพื่อให้ปีกไก่เป็นสีเหลืองทอง และไล่น้ำมัน", 
            "เมื่อได้สีเหลืองตามต้องการ ให้นำปีกไก่ขึ้นจากกระทะ พักให้สะเด็ดน้ำมัน พร้อมรับทาน"]},
    
    {"Name":"เกี๊ยวน้ำ",
    "Ingredients":{"แผ่นเกี๊ยว":"แผ่นเกี๊ยว 10 แผ่น", "หมูสับ":"หมูสับ 150 กรัม", "ซีอิ๊วขาว":"ซีอิ๊วขาว 1 ช้อนชา",
                "น้ำมันงา":"น้ำมันงา 1/2 ช้อนชา", "กระเทียมเจียว":"กระเทียมเจียว 1 ช้อนโต๊ะ", "น้ำซุปไก่":"น้ำซุปไก่ 2 ถ้วยตวง"},
    "Recipe":["หมักหมูสับกับซีอิ๊วขาว น้ำมันงาเล็กน้อย", "ห่อหมูด้วยแผ่นเกี๊ยว", "ต้มน้ำซุปให้เดือด ใส่เกี๊ยวลงไป", "โรยกระเทียมเจียวเล็กน้อย พร้อมเสิร์ฟ"]},

    {"Name":"ปลานึ่งซีอิ๊ว",
    "Ingredients":{"เนื้อปลา":"เนื้อปลา (ปลากะพง/ดอลลี่) 200 กรัม", "ซีอิ๊วขาว":"ซีอิ๊วขาว 1 ช้อนโต๊ะ", "ขิงซอย":"ขิงซอย 1 ช้อนโต๊ะ", "ต้นหอม":"ต้นหอม 1 ต้น (หั่นเป็นท่อน)"},
    "Recipe":["วางปลาในจาน โรยขิงและต้นหอม", "ราดซีอิ๊วขาวลงไป", "นำไปนึ่ง 10-15 นาที", "พร้อมเสิร์ฟแบบร้อนๆ"]},

    {"Name":"มาม่าผัดพริกเกลือ",
    "Ingredients":{"มาม่า":"มาม่า(รสหมูสับ) 3 ห่อ", "เบคอน":"เบคอน 100 กรัม", "กระเทียม":"กระเทียม 2 ช้อนโต๊ะ", "พริก":"พริกแดงจินดา 2 ช้อนโต๊ะ",
                "ต้นหอม":"ต้นหอม 2 ช้อนโต๊ะ", "เครื่องปรุงรสมาม่า":"เครื่องปรุงรสมาม่า 1/2 ซอง"},
    "Recipe":["นำเส้นมาม่าลงไปต้มในหม้อเดือด ลวกให้เส้นพอสุก ไม่ต้องนิ่มมาก ปิดเตานำขึ้นพักให้สะเด็ดน้ำ", 
            "เปิดเตาอีกครั้ง ใส่เบคอนลงไป (ไม่ต้องใส่น้ำมัน) ใช้ไฟกลาง ผัดให้เบคอนสุก ตักน้ำมันส่วนเกินออก ให้เหลือในกระทะเล็กน้อย",
            "ตักเบคอนออกเล็กน้อย เปิดเตาใช้ไฟกลาง ใส่กระเทียมสับลงไป ผัดให้หอม ใส่พริกซอยลงไป ผัดให้พริกส่งกลิ่นหอม", 
            "นำเส้นมาม่าลงไปผัด ขยี้ให้เส้นมาม่ากระจายตัว ให้มีความเกรียมเล็กน้อย", 
            "ใส่ผลปรุงรสของมาม่าลงไป โรยดด้วยต้นหอม คลุกเคล้าให้เข้ากันอีกครั้ง ปิดเตา เป็นอันเสร็จ"]}
]